# Используем официальный образ Python как базу
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера.
# Все последующие команды будут выполняться в /app.
WORKDIR /app

# Копируем файл с зависимостями.
# Это делается отдельно, чтобы Docker кэшировал этот слой.
# Если ты поменяешь код, но не зависимости, сборка будет быстрее.
COPY req.txt .

# Устанавливаем все библиотеки из requirements.txt.
# --no-cache-dir делает сборку чуть медленнее, но образ меньше.
RUN pip install --no-cache-dir -r req.txt

# Копируем весь остальной код проекта в контейнер.
# Точка в конце означает, что копируем всё из текущей директории.
COPY . .

# Команда, которая будет выполняться при запуске контейнера.
# Она запускает твой основной файл.
CMD ["python", "main.py"]